// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт максимальное число
// a = 5; b = 7 ->  max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

// Задача 2:________________________________________________________

// Console.Write("Введите число 1: ");
// int n1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Ввелите Число 2: ");
// int n2 = Convert.ToInt32(Console.ReadLine());


// if(n1 > n2)
// {
//     Console.WriteLine(n1);
// }
// else
// {
//     Console.WriteLine(n2);
// }

// _________________________________________________________________

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// Задача 4:________________________________________________________

// Console.Write("Введите число 1: ");
// int n1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Ввелите Число 2: ");
// int n2 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Ввелите Число 3: ");
// int n3 = Convert.ToInt32(Console.ReadLine());

// int max = 0;

// if(n1 > n2)
// {
//     max = n1;
// }
// else
// {
//     max = n2;
// }

// if(max > n3)
// {
//     Console.WriteLine(max);
// }
// else
// {
//     Console.WriteLine(n3);
// }

// _________________________________________________________________

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

// Задача 6:________________________________________________________

// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());

// if(n % 2 == 0) 
// {
//     Console.WriteLine("Число является чётным");
// }
// else 
// {
//     Console.WriteLine("Число не является чётным");
// }

// _________________________________________________________________

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

// Задача 8:________________________________________________________

// Console.Write("Введите число: ");
// int N = Convert.ToInt32(Console.ReadLine());

// int count = 1;

// while(count <= N)
// {
//     if(count % 2 == 0)
//     {
//     Console.Write(count + ", ");
//     }
// count++;
// }
// _________________________________________________________________